renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx26t/r_s12ad_rx26t.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS 
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2022 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_s12ad_rx26t.c
* Description  : Primary source code for 12-bit A/D Converter driver.
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version Description
*           01.08.2022 1.00    Initial Release.
*           02.02.2023 1.10    Supports 48K RAM capacity.
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
/* Includes board and MCU related header files. */
#include <stdio.h>
#include "platform.h"

#if defined (BSP_MCU_RX26T)
#include "r_s12ad_rx_config.h"
#include "r_s12ad_rx_private.h"
#include "r_s12ad_rx_if.h"

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/
#if ADC_PRV_RAMSIZE_IS_48K
#define ADC_PRV_GET_REGS_PTR(x)    (((x)==0) ?  (aregs_t *)&S12AD  : \
                                                (aregs_t *)&S12AD2)

#define ADC_PRV_GET_SST_ARR(x)     (((x)==0) ?  gp_sreg0_ptrs : \
                                                gp_sreg2_ptrs)

#define ADC_PRV_LOCK(x)            (((x)==0) ?  BSP_LOCK_S12AD  : \
                                                BSP_LOCK_S12AD2)

#define ADC_PRV_SST_REG_MAX(x)     (((x)==0) ?  ADC_SST_CH7 : \
                                                ADC_SST_REG_MAX)
#else
#define ADC_PRV_GET_REGS_PTR(x)    (((x)==0) ?  (aregs_t *)&S12AD  : \
                                    ((x)==1) ?  (aregs_t *)&S12AD1 : \
                                                (aregs_t *)&S12AD2)

#define ADC_PRV_GET_SST_ARR(x)     (((x)==0) ?  gp_sreg0_ptrs : \
                                    ((x)==1) ?  gp_sreg1_ptrs : \
                                                gp_sreg2_ptrs)

#define ADC_PRV_LOCK(x)            (((x)==0) ?  BSP_LOCK_S12AD  : \
                                    ((x)==1) ?  BSP_LOCK_S12AD1 : \
                                                BSP_LOCK_S12AD2)

#define ADC_PRV_SST_REG_MAX(x)     (((x)==0) ?  ADC_SST_CH3 : \
                                    ((x)==1) ?  ADC_SST_CH3 : \
                                                ADC_SST_REG_MAX)

#endif /* ADC_PRV_RAMSIZE_IS_48K */

#define ADC_PRV_GRPBL1_S12CMPIA0_FLAG    (1<<20)
#define ADC_PRV_GRPBL1_S12CMPIB0_FLAG    (1<<21)
#define ADC_PRV_GRPBL1_S12CMPIA1_FLAG    (1<<22)
#define ADC_PRV_GRPBL1_S12CMPIB1_FLAG    (1<<23)
#define ADC_PRV_GRPBL1_S12CMPIA2_FLAG    (1<<18)
#define ADC_PRV_GRPBL1_S12CMPIB2_FLAG    (1<<19)

#if ADC_PRV_RAMSIZE_IS_48K
#define ADC_PRV_UNIT_CHECK ((unit > 2) || (unit == 1))
#else
#define ADC_PRV_UNIT_CHECK (unit > 2)
#endif /* ADC_PRV_RAMSIZE_IS_48K */



/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/
/* Unit2 registers are a superset of Unit0, 1 EXCEPT that they do not contain the S&H registers and the PGA registers */
typedef R_BSP_VOLATILE_EVENACCESS struct st_s12ad2   aregs_t;

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
/* In RAM */

adc_ctrl_t g_dcb[3] = {{ADC_MODE_MAX,
                        NULL,
                        false,
                        ADC_PRV_GRPBL1_S12CMPIA0_FLAG,
                        ADC_PRV_GRPBL1_S12CMPIB0_FLAG},

                        {ADC_MODE_MAX,
                        NULL,
                        false,
                        ADC_PRV_GRPBL1_S12CMPIA1_FLAG,
                        ADC_PRV_GRPBL1_S12CMPIB1_FLAG},

                        {ADC_MODE_MAX,
                        NULL,
                        false,
                        ADC_PRV_GRPBL1_S12CMPIA2_FLAG,
                        ADC_PRV_GRPBL1_S12CMPIB2_FLAG}};

/* In ROM. A/D Data Register pointers */
#if ADC_PRV_RAMSIZE_IS_48K
volatile uint16_t R_BSP_EVENACCESS_SFR * const  gp_dreg0_ptrs[ADC_REG_MAX+1] =
                    {   &S12AD.ADDR0,       /* channel 0 */
                        &S12AD.ADDR1,       /* channel 1 */
                        &S12AD.ADDR2,       /* channel 2 */
                        &S12AD.ADDR3,       /* channel 3 */
                        &S12AD.ADDR4,       /* channel 4 */
                        &S12AD.ADDR5,       /* channel 5 */
                        &S12AD.ADDR6,       /* channel 6 */
                        NULL,               /* channel 7 */
                        NULL,               /* channel 8 */
                        NULL,               /* channel 9 */
                        NULL,               /* channel 10 */
                        NULL,               /* channel 11 */
                        NULL,               /* channel 16 */
                        NULL,               /* channel 17 */
                        NULL,               /* temperature sensor */
                        NULL,               /* voltage sensor */
                        &S12AD.ADDBLDR,     /* double trigger register */
                        &S12AD.ADDBLDRA,    /* double trigger registerA */
                        &S12AD.ADDBLDRB,    /* double trigger registerB */
                        &S12AD.ADRD.WORD    /* self-diagnosis register */
                    };
                    
volatile uint16_t R_BSP_EVENACCESS_SFR * const  gp_dreg1_ptrs[1] =
                    {   NULL,                /* Dummy is placed because there is no Unit1 in RAM capacity 48K */
                    };
                    
