renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx26t/r_s12ad_rx26t.c
    /* A/D Sampling State Register initialize */
    p_regs->ADSSTR0 = 0x1B;
    p_regs->ADSSTR1 = 0x1B;
    p_regs->ADSSTR2 = 0x1B;
    p_regs->ADSSTR3 = 0x1B;

    /* A/D Channel Conversion Order Setting Register initialize */
    p_regs->ADSCS0 = 0x00;
    p_regs->ADSCS1 = 0x01;
    p_regs->ADSCS2 = 0x02;
    p_regs->ADSCS3 = 0x03;

    if (0 == unit)
    {

        /* A/D Sample-and-Hold Circuit Control Register initialize */
        S12AD.ADSHCR.WORD = 0x001b;

        /* A/D Sample-and-Hold Operating Mode Select Register initialize */
        S12AD.ADSHMSR.BYTE = 0;
        if (0 != S12AD.ADSHMSR.BYTE)
        {

            /* Dommy read and compare */
            R_BSP_NOP();
        }
#if ADC_PRV_RAMSIZE_NOT_48K
        /* A/D Programmable Gain Amplifier Control Register initialize */
        S12AD.ADPGACR.WORD = 0x0000;

        /* A/D Programmable Gain Amplifier Gain Setting Register 0 initialize */
        S12AD.ADPGAGS0.WORD = 0x0000;
#endif /* ADC_PRV_RAMSIZE_NOT_48K */
    }
#if ADC_PRV_RAMSIZE_NOT_48K
    else if (1 == unit)
    {

        /* A/D Sample-and-Hold Circuit Control Register initialize */
        S12AD1.ADSHCR.WORD = 0x001b;

        /* A/D Sample-and-Hold Operating Mode Select Register initialize */
        S12AD1.ADSHMSR.BYTE = 0;
        if (0 != S12AD1.ADSHMSR.BYTE)
        {

            /* Dommy read and compare */
            R_BSP_NOP();
        }

        /* A/D Programmable Gain Amplifier Control Register initialize */
        S12AD1.ADPGACR.WORD = 0x0000;

        /* A/D Programmable Gain Amplifier Gain Setting Register 0 initialize */
        S12AD1.ADPGAGS0.WORD = 0x0000;
    }
#endif /* ADC_PRV_RAMSIZE_NOT_48K */
    else
    {

        /* A/D Channel Select Register A1 initialize */
        S12AD2.ADANSA1.WORD = 0;

        /* A/D-Converted Value Addition/Average Function Select Register 1 initialize */
        S12AD2.ADADS1.WORD = 0;

        /* A/D Conversion Extended Input Control Register initialize */
        S12AD2.ADEXICR.WORD = 0;

        /* A/D Channel Select Register B1 initialize */
        S12AD2.ADANSB1.WORD = 0;

        /* A/D Comparison Function Window A Extended Input Select Register initialize */
        S12AD2.ADCMPANSER.BYTE = 0;

        /* A/D Comparison Function Window A Extended Input Comparison Condition
           Setting Register initialize */
        S12AD2.ADCMPLER.BYTE = 0;

        /* A/D Comparison Function Window A Channel Select Register 1 initialize */
        S12AD2.ADCMPANSR1.WORD = 0;

        /* A/D Comparison Function Window A Comparison Condition Setting Register 1 initialize */
        S12AD2.ADCMPLR1.WORD = 0;

        /* A/D Comparison Function Window A Channel Status Register 1 initialize */
        u16_dummy = S12AD2.ADCMPSR1.WORD;
        S12AD2.ADCMPSR1.WORD = 0;

        /* A/D Comparison Function Window A Extended Input Channel Status Register initialize */
        u8_dummy = S12AD2.ADCMPSER.BYTE;
        S12AD2.ADCMPSER.BYTE = 0;

        /* A/D Channel Select Register C1 initialize */
        S12AD2.ADANSC1.WORD = 0;

        /* A/D Group C Extended Input Control Register */
        S12AD2.ADGCEXCR.BYTE = 0;

        /* A/D Sampling State Register initialize */
        S12AD2.ADSSTRL = 0x1B;
        S12AD2.ADSSTRT = 0x1B;
        S12AD2.ADSSTRO = 0x1B;
        S12AD2.ADSSTR4 = 0x1B;
        S12AD2.ADSSTR5 = 0x1B;
        S12AD2.ADSSTR6 = 0x1B;
        S12AD2.ADSSTR7 = 0x1B;
        S12AD2.ADSSTR8 = 0x1B;
        S12AD2.ADSSTR9 = 0x1B;
        S12AD2.ADSSTR10 = 0x1B;
        S12AD2.ADSSTR11 = 0x1B;
        if (0 != S12AD2.ADSSTR11)
        {

            /* Dommy read and compare */
            R_BSP_NOP();
        }

        /* A/D Channel Conversion Order Setting Register initialize */
        S12AD2.ADSCS4 = 0x04;
        S12AD2.ADSCS5 = 0x05;
        S12AD2.ADSCS6 = 0x06;
        S12AD2.ADSCS7 = 0x07;
        S12AD2.ADSCS8  = 0x08;
        S12AD2.ADSCS9  = 0x09;
        S12AD2.ADSCS10 = 0x0A;
        S12AD2.ADSCS11 = 0x0B;
        S12AD2.ADSCS12 = 0x10;
        S12AD2.ADSCS13 = 0x11;

        /* A/D Internal Reference Voltage Monitoring Circuit Enable Register initialize */
        S12AD2.ADVMONCR.BYTE = 0;

        /* A/D Internal Reference Voltage Monitoring Circuit Output Enable Register initialize */
        S12AD2.ADVMONO.BYTE = 0;
    }

    /* SET TEMPERATURE SENSOR */
    if (2 == unit)
    {
        if (ADC_TEMP_SENSOR_NOT_AD_CONVERTED != p_cfg->temp_sensor)
        {
            if (ADC_TEMP_SENSOR_AD_CONVERTED == p_cfg->temp_sensor)
            {
                S12AD2.ADEXICR.BIT.TSSA = 1;     // select temperature output GroupA
                S12AD2.ADEXICR.BIT.TSSB = 0;
                S12AD2.ADGCEXCR.BIT.TSSC = 0;
            }
            else if (ADC_TEMP_SENSOR_AD_CONVERTED_GROUPB == p_cfg->temp_sensor)
            {
                S12AD2.ADEXICR.BIT.TSSA = 0;
                S12AD2.ADEXICR.BIT.TSSB = 1;     // select temperature output GroupB
                S12AD2.ADGCEXCR.BIT.TSSC = 0;
            }
            else
            {
                S12AD2.ADEXICR.BIT.TSSA = 0;
                S12AD2.ADEXICR.BIT.TSSB = 0;
                S12AD2.ADGCEXCR.BIT.TSSC = 1;    // select temperature output GroupC
            }
        }
    }

    /* SET MODE RELATED REGISTER FIELDS */
    g_dcb[unit].mode = mode;
    if ((ADC_MODE_SS_MULTI_CH_GROUPED == mode)
    || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A == mode))
    {
        p_regs->ADCSR.BIT.ADCS = ADC_ADCS_GROUP_SCAN;
    }
    else if ((ADC_MODE_SS_MULTI_CH_GROUPED_GROUPC == mode)
    || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A_GROUPC == mode))
    {
        p_regs->ADCSR.BIT.ADCS = ADC_ADCS_GROUP_SCAN;
        p_regs->ADGCTRGR.BIT.GRCE = 1;       // Use Group C
    }
    else
    {
        if ((ADC_MODE_CONT_ONE_CH == mode) || (ADC_MODE_CONT_MULTI_CH == mode))
        {
            p_regs->ADCSR.BIT.ADCS = ADC_ADCS_CONT_SCAN;
        }

        /* other modes have ADCS=0 */
    }

    if ((ADC_MODE_SS_ONE_CH_DBLTRIG == mode)
    || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A == mode)
    || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A_GROUPC == mode))
    {
        p_regs->ADCSR.BIT.DBLE = 1;         // enable double trigger
    }

    /* SET TRIGGER AND INTERRUPT PRIORITY REGISTER FIELDS */
    if (ADC_TRIG_SOFTWARE != p_cfg->trigger)
    {
        p_regs->ADSTRGR.BIT.TRSA = p_cfg->trigger;
    }

    if (ADC_TRIG_ASYNC_ADTRG == p_cfg->trigger)
    {
        p_regs->ADCSR.BIT.EXTRG = 1;        // set ext trigger for async trigger
    }

    if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
    {
        p_regs->ADSTRGR.BIT.TRSB = p_cfg->trigger_groupb;
        p_regs->ADGCTRGR.BIT.TRSC = p_cfg->trigger_groupc & 0x3F;      // for Group C
        p_regs->ADGCTRGR2.BIT.TRSC6 = p_cfg->trigger_groupc >> 6;
        if (0 == unit)
        {
            IPR(S12AD,S12GBADI) = p_cfg->priority_groupb;
            IPR(S12AD,S12GCADI) = p_cfg->priority_groupc;    // for Group C
        }
#if ADC_PRV_RAMSIZE_NOT_48K
        else if (1 == unit)
        {
            IPR(S12AD1,S12GBADI1) = p_cfg->priority_groupb;
            IPR(S12AD1,S12GCADI1) = p_cfg->priority_groupc;    // for Group C
        }
#endif /* ADC_PRV_RAMSIZE_NOT_48K */
        else
        {
            IPR(S12AD2,S12GBADI2) = p_cfg->priority_groupb;
            IPR(S12AD2,S12GCADI2) = p_cfg->priority_groupc;    // for Group C
        }
    }

    if (0 == unit)
    {
        IPR(S12AD,S12ADI) = p_cfg->priority;
    }
#if ADC_PRV_RAMSIZE_NOT_48K
    else if (1 == unit)
    {
        IPR(S12AD1,S12ADI1) = p_cfg->priority;
    }
#endif /* ADC_PRV_RAMSIZE_NOT_48K */
    else
    {
        IPR(S12AD2,S12ADI2) = p_cfg->priority;
    }

    /* SET REGISTER FIELDS FOR REMAINING PARAMETERS */
    p_regs->ADCER.BIT.ADRFMT = (ADC_ALIGN_LEFT == p_cfg->alignment) ? 1 : 0;
    p_regs->ADCER.BIT.ACE = (ADC_CLEAR_AFTER_READ_ON == p_cfg->clearing) ? 1 : 0; 
    p_regs->ADCER.BIT.ASE = (ADC_AUTO_SET_ON == p_cfg->setting) ? 1 : 0;
    if (2 == unit)
    {
        if (ADC_TEMP_SENSOR_NOT_AD_CONVERTED != p_cfg->temp_sensor)
        {
            S12AD2.ADEXICR.BIT.TSSAD = (ADC_TEMP_SENSOR_ADD_ON == p_cfg->add_temp_sensor) ? 1 : 0;
        }
    }
    p_regs->ADADC.BYTE = p_cfg->add_cnt;

    /* SAVE CALLBACK FUNCTION POINTER */
    g_dcb[unit].p_callback = p_callback;

