renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx26t/r_s12ad_rx26t.c
        p_regs->ADCMPCR.BIT.CMPAE = 1;
    }
    else
    {
        p_regs->ADCMPCR.BIT.CMPAE = 0;
    }

    if (true == p_cmpwin->windowb_enable) // COMPARATOR B
    {
        p_regs->ADCMPCR.BIT.CMPBE = 0;

        p_regs->ADWINLLB = p_cmpwin->level_lob;

        if (1 == p_regs->ADCMPCR.BIT.WCMPE)
        {
            p_regs->ADWINULB = p_cmpwin->level_hib;
        }
        
        p_regs->ADCMPBNSR.BIT.CMPCHB = p_cmpwin->compare_maskb & 0x3F;
        p_regs->ADCMPBNSR.BIT.CMPLB = p_cmpwin->inside_window_maskb;

        p_regs->ADCMPCR.BIT.CMPBE = 1;
    }
    else
    {
        p_regs->ADCMPCR.BIT.CMPBE = 0;
    }

    /* Window A/B Composite Conditions Setting */

    if ((true == p_cmpwin->windowa_enable) && (true == p_cmpwin->windowb_enable))
    {
        p_regs->ADCMPCR.BIT.CMPAB = p_cmpwin->comp_cond;
    }

    /* ENABLE INTERRUPT */
    /* Clear interrupt subvector flag and set callback */
    if (0 != p_cmpwin->int_priority)
    {

        /* Cast from uint8_t to uint32_t */
        group_priority.ipl = (uint32_t)(p_cmpwin->int_priority);

        if (true == p_cmpwin->windowa_enable) // COMPARATOR A
        {
            R_BSP_InterruptWrite(BSP_INT_SRC_BL1_S12AD0_S12CMPAI, adc_s12cmpia0_isr);
            R_BSP_InterruptWrite(BSP_INT_SRC_BL1_S12AD1_S12CMPAI1, adc_s12cmpia1_isr);
            R_BSP_InterruptWrite(BSP_INT_SRC_BL1_S12AD2_S12CMPAI2, adc_s12cmpia2_isr);
            p_regs->ADCMPCR.BIT.CMPAIE = 1;             // enable interrupt in ADC
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
            ICU.GENBL1.LONG |= g_dcb[unit].cmpi_mask;   // enable group subvector
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
            if (0 == unit)
            {
                R_BSP_InterruptControl(BSP_INT_SRC_BL1_S12AD0_S12CMPAI,

                                        /* Cast to match the argument type */
                                        BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *) &group_priority);
            }
#if ADC_PRV_RAMSIZE_NOT_48K
            else if (1 == unit)
            {
                R_BSP_InterruptControl(BSP_INT_SRC_BL1_S12AD1_S12CMPAI1,

                                        /* Cast to match the argument type */
                                        BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *) &group_priority);
            }
#endif /* ADC_PRV_RAMSIZE_NOT_48K */
            else
            {
                R_BSP_InterruptControl(BSP_INT_SRC_BL1_S12AD2_S12CMPAI2,

                                        /* Cast to match the argument type */
                                        BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *) &group_priority);
            }
        }

        if (true == p_cmpwin->windowb_enable) // COMPARATOR B
        {
            R_BSP_InterruptWrite(BSP_INT_SRC_BL1_S12AD0_S12CMPBI, adc_s12cmpib0_isr);
            R_BSP_InterruptWrite(BSP_INT_SRC_BL1_S12AD1_S12CMPBI1, adc_s12cmpib1_isr);
            R_BSP_InterruptWrite(BSP_INT_SRC_BL1_S12AD2_S12CMPBI2, adc_s12cmpib2_isr);
            p_regs->ADCMPCR.BIT.CMPBIE = 1;             // enable interrupt in ADC
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
            ICU.GENBL1.LONG |= g_dcb[unit].cmpi_maskb;   // enable group subvector
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
            if (0 == unit)
            {
                R_BSP_InterruptControl(BSP_INT_SRC_BL1_S12AD0_S12CMPBI,

                                        /* Cast to match the argument type */
                                        BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *) &group_priority);
            }
#if ADC_PRV_RAMSIZE_NOT_48K
            else if (1 == unit)
            {
                R_BSP_InterruptControl(BSP_INT_SRC_BL1_S12AD1_S12CMPBI1,

                                        /* Cast to match the argument type */
                                        BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *) &group_priority);
            }
#endif /* ADC_PRV_RAMSIZE_NOT_48K */
            else
            {
                R_BSP_InterruptControl(BSP_INT_SRC_BL1_S12AD2_S12CMPBI2,

                                        /* Cast to match the argument type */
                                        BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *) &group_priority);
            }
        }
    }

    /* Do NOT enable GENBL1, CMPIAE or CMPIBE here with the intention of polling the GRPBL1 bit
     * for condition met. Another driver may make the GROUPBL1 priority non-zero
     * and there will be no subvector interrupt/callback here to clear the ICU flag.
     * The result will be that the BSP will be in an "infinite loop" processing the
     * group interrupt because the flag never resets, and the app level will not run.
     */

    return ADC_SUCCESS;
} /* End of function adc_en_comparator_level0() */


/*****************************************************************************
* Function Name: adc_get_and_clr_cmpi_flags
* Description  : Returns flags for all channels/sensors that met comparator
*                condition and clears the flags for next interrupt.
* Arguments    : unit -
*                    Unit number (0, 1 or 2)
* Return Value : channels/sensors that met comparator condition
******************************************************************************/
static uint32_t adc_get_and_clr_cmpi_flags(uint8_t unit)
{
    volatile uint32_t    flags;
    uint32_t tmp_flags;
    aregs_t     *p_regs;

