renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx26t/r_s12ad_rx26t.c
    /* NOTE: S12CMPAI interrupts are level-based, not edge, so there will be
     * continuous triggers while condition is met. Writing 0 to the flags has
     * no effect UNTIL the condition clears.
     *
     * Also, the data register for the channel/sensor will still be written to.
     * The S12CMPAI interrupt does not replace it but is in addition to it.
     */

    /* Get S12AD register address */
    p_regs = ADC_PRV_GET_REGS_PTR(unit);

    /* Cast to match variable type */
    flags = (uint32_t)p_regs->ADCMPSR0.WORD;
    p_regs->ADCMPSR0.WORD = 0;

    if (0 == p_regs->ADCMPSR0.WORD)
    {
        R_BSP_NOP();
    }

    if (2 == unit)
    {

        /* Cast to match variable type */
        tmp_flags = (((uint32_t)p_regs->ADCMPSR1.WORD) << 16);
        flags |= tmp_flags;
        p_regs->ADCMPSR1.WORD = 0;

        if (0 == p_regs->ADCMPSR1.WORD)
        {
            R_BSP_NOP();
        }

        if (1 == p_regs->ADCMPSER.BIT.CMPFTS)
        {
            flags |= ADC_MASK_TEMP;
        }

        if (1 == p_regs->ADCMPSER.BIT.CMPFOC)
        {
            flags |= ADC_MASK_VOLT;
        }

        p_regs->ADCMPSER.BYTE = 0;

        if (0 == p_regs->ADCMPSER.BYTE)
        {
            R_BSP_NOP();
        }
    }

    return flags;
} /* End of function adc_get_and_clr_cmpi_flags() */


/*****************************************************************************
* Function Name: adc_get_and_clr_cmpi_flagsb
* Description  : Returns flags for all channels/sensors that met comparator
*                condition and clears the flags for next interrupt.
* Arguments    : unit -
*                    Unit number (0, 1 or 2)
* Return Value : channels/sensors that met comparator condition
******************************************************************************/
static uint32_t adc_get_and_clr_cmpi_flagsb(uint8_t unit)
{
    volatile uint32_t    flags;
    aregs_t     *p_regs;

    /* NOTE: S12CMPBI interrupts are level-based, not edge, so there will be
     * continuous triggers while condition is met. Writing 0 to the flags has
     * no effect UNTIL the condition clears.
     *
     * Also, the data register for the channel/sensor will still be written to.
     * The S12CMPBI interrupt does not replace it but is in addition to it.
     */

    /* Get S12AD register address */
    p_regs = ADC_PRV_GET_REGS_PTR(unit);

    /* Cast to match variable type */
    flags = (uint32_t)p_regs->ADCMPBSR.BIT.CMPSTB;
    p_regs->ADCMPBSR.BIT.CMPSTB = 0;
    if (0 == p_regs->ADCMPBSR.BIT.CMPSTB)
    {
        R_BSP_NOP();
    }

    return flags;
} /* End of function adc_get_and_clr_cmpi_flagsb() */


/******************************************************************************
* Function Name: adc_configure_scan
* Description  : This function does extensive checking on channel mask
*                settings based upon operational mode. Mask registers are
*                initialized and interrupts enabled in peripheral. Interrupts
*                are also enabled in ICU if corresponding priority is not 0.
*
* Arguments    : p_config
*                    Pointer to channel config structure containing masks
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_INVALID_ARG-
*                    reg_id contains an invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    an argument is illegal based upon rest of configuration
*******************************************************************************/
static adc_err_t adc_configure_scan(uint8_t const   unit,
                                    adc_ch_cfg_t   *p_config)
{

    /* Get S12AD register address */
    aregs_t     *p_regs = ADC_PRV_GET_REGS_PTR(unit);
    uint32_t  i;
    volatile uint32_t  tmp_mask=0;
    volatile uint16_t  trig_a;
    volatile uint16_t  trig_b;
    volatile uint16_t  trig_c;
    volatile uint8_t   tmp_adscs[ADC_2_REG_ARRAY_MAX];
    volatile uint32_t  conv_order_cnt;
    volatile uint32_t  bit_cnt;
    volatile uint32_t  tmp_adansa;
    volatile uint32_t  tmp_adansa_invert;
    uint16_t  tmp_trig_c;
#if ADC_PRV_RAMSIZE_NOT_48K
    volatile uint16_t  tmp_adpgags0[ADC_PGA_CHANNEL_MAX];
    volatile uint16_t  tmp_adpgacr[ADC_PGA_CHANNEL_MAX];
    uint16_t  tmp_adpgags0_regs;
    uint16_t  tmp_adpgacr_regs;
#endif /* ADC_PRV_RAMSIZE_NOT_48K */

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    adc_err_t   err;

    err = adc_check_scan_config(unit, p_config);
    if (ADC_SUCCESS != err)
    {
        return err;
    }

#endif /* ADC_CFG_PARAM_CHECKING_ENABLE == 1 */

    /* SET MASKS FOR CHANNELS AND SENSORS */

    /* Cast to match the register type */
    p_regs->ADANSA0.WORD = (uint16_t) (p_config->chan_mask & 0x0FFF);

    /* Cast to match the register type */
    p_regs->ADANSB0.WORD = (uint16_t) (p_config->chan_mask_groupb & 0x0FFF);

    /* Cast to match the register type */
    p_regs->ADANSC0.WORD = (uint16_t) (p_config->chan_mask_groupc & 0x0FFF);

    /* Cast to match the register type */
    p_regs->ADADS0.WORD = (uint16_t) (p_config->add_mask & 0x0FFF);

    if (2 == unit)
    {

        /* Cast to match the register type */
        S12AD2.ADANSA1.WORD = (uint16_t) ((p_config->chan_mask >> 16) & 0x0003);

        /* Cast to match the register type */
        S12AD2.ADANSB1.WORD = (uint16_t) ((p_config->chan_mask_groupb >> 16) & 0x0003);

        /* Cast to match the register type */
        S12AD2.ADANSC1.WORD = (uint16_t) ((p_config->chan_mask_groupc >> 16) & 0x0003);

        /* Cast to match the register type */
        S12AD2.ADADS1.WORD = (uint16_t) ((p_config->add_mask >> 16) & 0x0003);

        adc_configure_sensors(p_config);
    }

    /* SET ORDER OF CHANNEL CONVERSION */
    tmp_adansa = 0;
    tmp_adansa |= (p_config->chan_mask & 0x00030FFF);
    tmp_adansa |= (p_config->chan_mask_groupb & 0x00030FFF);
    tmp_adansa |= (p_config->chan_mask_groupc & 0x00030FFF);
    tmp_adansa_invert = ((~tmp_adansa) & 0x00030FFF);

