renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx26t/r_s12ad_rx26t.c
    bit_cnt = 0;
    conv_order_cnt = 0;

    /* WAIT_LOOP */
    for (i= 0x00000001; i<0x00040000; i<<=1)
    {
        if (0 != (tmp_adansa & i))
        {
            bit_cnt++;
        }
    }

    /* WAIT_LOOP */
    for (i=bit_cnt; i<ADC_2_REG_ARRAY_MAX; i++)
    {

        /* WAIT_LOOP */
        while (conv_order_cnt<32)
        {
            if (1 == (tmp_adansa_invert & 0x00000001))
            {
                tmp_adscs[i] = conv_order_cnt;
                tmp_adansa_invert >>= 1;
                conv_order_cnt++;
                break;
            }

            tmp_adansa_invert >>= 1;
            conv_order_cnt++;
        }
    }

    conv_order_cnt = 0;

    if (ADC_CONV_ORDER_MANUAL_SETTING == p_config->conv_order_status)
    {

        /* WAIT_LOOP */
        for (i=0; i<bit_cnt; i++)
        {
            tmp_adscs[i] = 0;
            conv_order_cnt = p_config->conversion_order[i];

            /* WAIT_LOOP */
            while (conv_order_cnt > 1)
            {
                tmp_adscs[i]++;
                conv_order_cnt >>= 1;
            }
        }
    }
    else
    {

        /* WAIT_LOOP */
        for (i=0; i<bit_cnt; i++)
        {

            /* WAIT_LOOP */
            while (conv_order_cnt<32)
            {
                if (1 == (tmp_adansa & 0x00000001))
                {
                    tmp_adscs[i] = conv_order_cnt;
                    tmp_adansa >>= 1;
                    conv_order_cnt++;
                    break;
                }

                tmp_adansa >>= 1;
                conv_order_cnt++;
            }
        }
    }

    /* Set ADSCSn Register */
    p_regs->ADSCS0 = tmp_adscs[0];
    p_regs->ADSCS1 = tmp_adscs[1];
    p_regs->ADSCS2 = tmp_adscs[2];
    p_regs->ADSCS3 = tmp_adscs[3];

    if (2 == unit)
    {
        p_regs->ADSCS4 = tmp_adscs[4];
        p_regs->ADSCS5 = tmp_adscs[5];
        p_regs->ADSCS6 = tmp_adscs[6];
        p_regs->ADSCS7 = tmp_adscs[7];
        p_regs->ADSCS8  = tmp_adscs[8];
        p_regs->ADSCS9  = tmp_adscs[9];
        p_regs->ADSCS10 = tmp_adscs[10];
        p_regs->ADSCS11 = tmp_adscs[11];
        p_regs->ADSCS12 = tmp_adscs[12];
        p_regs->ADSCS13 = tmp_adscs[13];
    }

    /* NOTE: S&H adds to scan time because normal state machine still runs. */
    /* adds 12 + sample_hold_states ADCLKS to scan time */
    if (0 == unit)
    {
        S12AD.ADSHCR.BIT.SHANS = p_config->sample_hold_mask;
        S12AD.ADSHCR.BIT.SSTSH = p_config->sample_hold_states;
    }
#if ADC_PRV_RAMSIZE_NOT_48K
    else if (1 == unit)
    {
        S12AD1.ADSHCR.BIT.SHANS = p_config->sample_hold_mask;
        S12AD1.ADSHCR.BIT.SSTSH = p_config->sample_hold_states;
    }

    /* SET PROGRAMMABLE GAIN AMPLIFIER */
    if ((0 == unit) || (1 == unit))
    {

        /* WAIT_LOOP */
        for (i=0; i<ADC_PGA_CHANNEL_MAX; i++)    /* ch0-2 */
        {
            tmp_adpgags0[i] = 0x0000;
            tmp_adpgacr[i] = 0x0000;

            /* Set ADPGACR.PxCR */
            switch (p_config->signal_path_control[i])
            {
                case ADC_ANALOG_INPUT_1:
                    tmp_adpgacr[i] = 0x0001;
                    break;

                case ADC_ANALOG_INPUT_2:
                    tmp_adpgacr[i] = 0x0008;
                    break;

                case ADC_ANALOG_INPUT_3:
                    tmp_adpgacr[i] = 0x0009;
                    break;

                case ADC_PGA_SINGLE_END_INPUT_1:
                    tmp_adpgacr[i] = 0x000C;
                    break;

                case ADC_PGA_SINGLE_END_INPUT_2:
                    tmp_adpgacr[i] = 0x000D;
                    break;

                case ADC_PGA_SINGLE_END_INPUT_3:
                    tmp_adpgacr[i] = 0x000E;
                    break;

                case ADC_GENERAL_PORT_1:
                default:
                    tmp_adpgacr[i] = 0x0000;
                    break;
            }

            /* Set ADPGAGS0.PxGAIN */
            tmp_adpgags0[i] = (uint16_t) (p_config->pga_gain[i] & 0x000F);
        }

        /* Set PGA Register */
        tmp_adpgags0_regs = (tmp_adpgags0[2]<<8);
        tmp_adpgags0_regs |= (tmp_adpgags0[1]<<4);
        tmp_adpgags0_regs |= tmp_adpgags0[0];

        tmp_adpgacr_regs = (tmp_adpgacr[2]<<8);
        tmp_adpgacr_regs |= (tmp_adpgacr[1]<<4);
        tmp_adpgacr_regs |= tmp_adpgacr[0];
        
        if (0 == unit)
        {
            S12AD.ADPGAGS0.WORD = (0x0FFF & tmp_adpgags0_regs);
            S12AD.ADPGACR.WORD = (0x0FFF & tmp_adpgacr_regs);
        }
        else if (1 == unit)
        {
            S12AD1.ADPGAGS0.WORD = (0x0FFF & tmp_adpgags0_regs);
            S12AD1.ADPGACR.WORD = (0x0FFF & tmp_adpgacr_regs);
        }
        /* Waiting time for PGA stabilization.
           Stabilization time * margin = 5us * 1.1 = 5.5us */
        R_BSP_SoftwareDelay(6, BSP_DELAY_MICROSECS);
    }
#endif /* ADC_PRV_RAMSIZE_NOT_48K */

    /* SET GROUP A PRIORITY ACTION (not interrupt priority!) */
    if (ADC_GRPA_PRIORITY_OFF != p_config->priority_groupa)
    {
        trig_a     = p_regs->ADSTRGR.BIT.TRSA;              // save TRSA
        trig_b     = p_regs->ADSTRGR.BIT.TRSB;              // save TRSB
        tmp_trig_c = p_regs->ADGCTRGR.BIT.TRSC;
        trig_c     = tmp_trig_c + (p_regs->ADGCTRGR2.BIT.TRSC6 << 6);             // save TRSC
        p_regs->ADSTRGR.BIT.TRSA = ADC_TRIG_NONE;
        p_regs->ADSTRGR.BIT.TRSB = ADC_TRIG_NONE;
        p_regs->ADGCTRGR.BIT.TRSC = ADC_TRIG_NONE;
        if (ADC_TRIG_NONE != p_regs->ADSTRGR.BIT.TRSA)  // bus wait for ADSTRGR write
        {
            R_BSP_NOP();
        }
        if (ADC_TRIG_NONE != p_regs->ADSTRGR.BIT.TRSB)  // bus wait for ADSTRGR write
        {
            R_BSP_NOP();
        }
        if (ADC_TRIG_NONE != p_regs->ADGCTRGR.BIT.TRSC) // bus wait for ADGCTRGR write
        {
            R_BSP_NOP();
        }

