renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx26t/r_s12ad_rx26t.c
    /* Addition mask should not include bits from inactive channels */
    if (ADC_ADD_OFF != p_regs->ADADC.BIT.ADC)
    {
        tmp_mask |= p_config->chan_mask;        // tmp_mask is Group A and B and C combined

        /* Bit-AND with 1s-complement */
        if ((p_config->add_mask & (~tmp_mask)) != 0)
        {
            return ADC_ERR_INVALID_ARG;
        }
    }
    else
    {

        /* WARNING! Other features messed up if add_mask is non-zero when addition is turned off!*/
        p_config->add_mask = 0;
    }

    /* Verify only 1 bit is set in default/Group A mask */

    if ((ADC_MODE_SS_ONE_CH == g_dcb[unit].mode)
    || (ADC_MODE_CONT_ONE_CH == g_dcb[unit].mode)
    || (1 == p_regs->ADCSR.BIT.DBLE))          // double trigger mode
    {
        tmp_mask = p_config->chan_mask;         // tmp_mask is non-Group/Group A chans

        /* Bit-AND with 2s-complement (see note in function header) */
        if ((tmp_mask & ((~tmp_mask) + 1)) != tmp_mask)
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
    }

    if (0 != p_config->sample_hold_mask)
    {
        if (2 == unit)                          // S&H only on unit 0
        {
            return ADC_ERR_ILLEGAL_ARG;
        }

        /* S&H chans can only be 0,1,2 and must have at least minimum state count specified */
        if ((p_config->sample_hold_mask > 0x7)
        || (p_config->sample_hold_states < ADC_SST_SH_CNT_MIN)
        || (p_config->sample_hold_states > ADC_SST_SH_CNT_MAX))
        {
            return ADC_ERR_INVALID_ARG;
        }

        /* S&H channels cannot not be split across groups */
        a_mask = p_config->sample_hold_mask & p_config->chan_mask;
        b_mask = p_config->sample_hold_mask & p_config->chan_mask_groupb;
        c_mask = p_config->sample_hold_mask & p_config->chan_mask_groupc;

        if (0 == unit)
        {
            tmp_adcsr = S12AD.ADCSR.BIT.ADCS;
        }
#if ADC_PRV_RAMSIZE_NOT_48K
        else if (1 == unit)
        {
            tmp_adcsr = S12AD1.ADCSR.BIT.ADCS;
        }
#endif /* ADC_PRV_RAMSIZE_NOT_48K */

        if (ADC_ADCS_GROUP_SCAN == tmp_adcsr)
        {
            if ((a_mask != p_config->sample_hold_mask) && (b_mask != p_config->sample_hold_mask))
            {
                return ADC_ERR_ILLEGAL_ARG;
            }
            if (1 == p_regs->ADGCTRGR.BIT.GRCE)
            {
                if ((a_mask != p_config->sample_hold_mask)
                && (b_mask != p_config->sample_hold_mask)
                && (c_mask != p_config->sample_hold_mask))
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }
        }
        else if (a_mask != p_config->sample_hold_mask)
        {
            return ADC_ERR_ILLEGAL_ARG;
        }

        /* S&H channels cannot be a double trigger channel (can be in group B) */
        if (0 == unit)
        {
            tmp_adcsr = S12AD.ADCSR.BIT.DBLE;
        }
#if ADC_PRV_RAMSIZE_NOT_48K
        else if (1 == unit)
        {
            tmp_adcsr = S12AD1.ADCSR.BIT.DBLE;
        }
#endif /* ADC_PRV_RAMSIZE_NOT_48K */

        if ((1 == tmp_adcsr) && (0 != a_mask))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }

        /* S&H channels cannot be in GroupB if GroupA priority enabled */ 
        if (((0 != b_mask) || (0 != c_mask)) && (ADC_GRPA_PRIORITY_OFF != p_config->priority_groupa))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
    }

    if ((ADC_DIAG_OFF != p_config->diag_method)
    &&   ((0 != p_regs->ADADC.BIT.ADC)           // addition
        || (1 == p_regs->ADCSR.BIT.DBLE)          // double trigger mode
        || (1 == p_regs->ADCMPCR.BIT.CMPAE)       // comparator A
        || (1 == p_regs->ADCMPCR.BIT.CMPBE)       // comparator B
        || (0 != (p_regs->ADDISCR.BYTE & 0x0F)))) // disconnect detection assist
    {
        return ADC_ERR_ILLEGAL_ARG;
    }
#if ADC_PRV_RAMSIZE_NOT_48K
    /* When converting the PGA output excluding the PGA bypass, 
       the disconnection detection assist function cannot be used. */
    if (0 != (p_regs->ADDISCR.BYTE & 0x0F))
    {
        if (ADC_PGA_SINGLE_END_INPUT_3 == p_config->signal_path_control[i])
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
    }
#endif /* ADC_PRV_RAMSIZE_NOT_48K */

    /* Parameter check of the order of channel conversion */
    if (ADC_CONV_ORDER_MANUAL_SETTING == p_config->conv_order_status)
    {
        tmp_mask = 0;

        /* WAIT_LOOP */
        for (i=0; i<ADC_2_REG_ARRAY_MAX; i++)    /* 0-13 (ch0-11, 16, 17) */
        {

            /* Macro definition must be used for parameter setting. */
            /* Temperature sensors can not be used. */
            /* Internal reference voltage can not be used. */
            if ((ADC_MASK_CH0 != p_config->conversion_order[i])
            && (ADC_MASK_CH1 != p_config->conversion_order[i])
            && (ADC_MASK_CH2 != p_config->conversion_order[i])
            && (ADC_MASK_CH3 != p_config->conversion_order[i])
            && (ADC_MASK_CH4 != p_config->conversion_order[i])
            && (ADC_MASK_CH5 != p_config->conversion_order[i])
            && (ADC_MASK_CH6 != p_config->conversion_order[i])
            && (ADC_MASK_CH7 != p_config->conversion_order[i])
            && (ADC_MASK_CH8 != p_config->conversion_order[i])
            && (ADC_MASK_CH9 != p_config->conversion_order[i])
            && (ADC_MASK_CH10 != p_config->conversion_order[i])
            && (ADC_MASK_CH11 != p_config->conversion_order[i])
            && (ADC_MASK_CH16 != p_config->conversion_order[i])
            && (ADC_MASK_CH17 != p_config->conversion_order[i])
            && (ADC_MASK_CONV_ORDER_OFF != p_config->conversion_order[i]))
            {
                return ADC_ERR_ILLEGAL_ARG;
            }

            tmp_mask |= p_config->conversion_order[i];
        }

        /* Only the channels specified to 1 (enable) in the A/D channel select register such as
           the ADANSA0/1, ADANSB0/1, and ADANSC0/1 registers should be used */
        /* All channels specified to 1 (enable) in the A/D channel select register such as
           the ADANSA0/1, ADANSB0/1, and ADANSC0/1 registers should be used. */
        tmp_adansa = 0;

