renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx26t/r_s12ad_rx26t.c
        tmp_adansa |= (p_config->chan_mask & 0x00030FFF);
        tmp_adansa |= (p_config->chan_mask_groupb & 0x00030FFF);
        tmp_adansa |= (p_config->chan_mask_groupc & 0x00030FFF);

        if (tmp_mask != tmp_adansa)
        {
            return ADC_ERR_ILLEGAL_ARG;
        }

        /* Should be set ADC_MASK_CONV_ORDER_OFF to not used ADSCSn register. */
        bit_cnt = 0;

        /* WAIT_LOOP */
        for (i= 0x00000001; i<0x00040000; i<<=1)
        {
            if (0 != (tmp_mask & i))
            {
                bit_cnt++;
            }
        }

        /* WAIT_LOOP */
        for (i=bit_cnt; i<ADC_2_REG_ARRAY_MAX; i++)
        {
            if (ADC_MASK_CONV_ORDER_OFF != p_config->conversion_order[i])
            {
                return ADC_ERR_ILLEGAL_ARG;
            }
        }

        /* Should be set the channels which use the channel-dedicated sample-and-hold circuit to 
           ADSCS0/1/2 registers. */
        if ((1 == unit) || (0 == unit))
        {
            if (0x01 == (p_config->sample_hold_mask & 0x01))
            {
                if ((ADC_MASK_CH0 != p_config->conversion_order[0])
                && (ADC_MASK_CH0 != p_config->conversion_order[1])
                && (ADC_MASK_CH0 != p_config->conversion_order[2]))
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }

            if (0x02 == (p_config->sample_hold_mask & 0x02))
            {
                if ((ADC_MASK_CH1 != p_config->conversion_order[0])
                && (ADC_MASK_CH1 != p_config->conversion_order[1])
                && (ADC_MASK_CH1 != p_config->conversion_order[2]))
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }

            if (0x04 == (p_config->sample_hold_mask & 0x04))
            {
                if ((ADC_MASK_CH2 != p_config->conversion_order[0])
                && (ADC_MASK_CH2 != p_config->conversion_order[1])
                && (ADC_MASK_CH2 != p_config->conversion_order[2]))
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }
        }
    }
#if ADC_PRV_RAMSIZE_NOT_48K
    /* Parameter check of the programmable gain amplifier */
    if ((1 == unit) || (0 == unit))
    {

        /* Enumeration constant must be used for the parameter setting. */
        /* WAIT_LOOP */
        for (i=0; i<ADC_PGA_CHANNEL_MAX; i++)    /* ch0-2 */
        {
            if (ADC_PATH_MAX <= p_config->signal_path_control[i])
            {
                return ADC_ERR_ILLEGAL_ARG;
            }
        }
        /* Should be set an appropriate gain. */
        /* WAIT_LOOP */
        for (i=0; i<ADC_PGA_CHANNEL_MAX; i++)    /* ch0-2 */
        {
            if ((ADC_GENERAL_PORT_1 == p_config->signal_path_control[i])
            || (ADC_ANALOG_INPUT_1 == p_config->signal_path_control[i])
            || (ADC_ANALOG_INPUT_2 == p_config->signal_path_control[i])
            || (ADC_ANALOG_INPUT_3 == p_config->signal_path_control[i]))
            {
                if (ADC_PGA_GAIN_OFF != p_config->pga_gain[i])
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }
            else if ((ADC_PGA_SINGLE_END_INPUT_1 == p_config->signal_path_control[i])
                || (ADC_PGA_SINGLE_END_INPUT_2 == p_config->signal_path_control[i])
                || (ADC_PGA_SINGLE_END_INPUT_3 == p_config->signal_path_control[i]))
            {
                if ((ADC_PGA_GAIN_2_000 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_2_500 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_3_077 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_3_636 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_4_000 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_4_444 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_5_000 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_6_667 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_8_000 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_10_000 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_13_333 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_20_000 != p_config->pga_gain[i]))
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }
        }
    }
    else if (2 == unit)
    {

        /* Unit 2 can not set PGA. */
        if ((ADC_ANALOG_INPUT_1 != p_config->signal_path_control[0])
        || (ADC_ANALOG_INPUT_1 != p_config->signal_path_control[1])
        || (ADC_ANALOG_INPUT_1 != p_config->signal_path_control[2]))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }

        if ((ADC_PGA_GAIN_OFF != p_config->pga_gain[0])
        || (ADC_PGA_GAIN_OFF != p_config->pga_gain[1])
        || (ADC_PGA_GAIN_OFF != p_config->pga_gain[2]))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
    }
#endif /* ADC_PRV_RAMSIZE_NOT_48K */

    return ADC_SUCCESS;
} /* End of function adc_check_scan_config() */
#endif /* ADC_CFG_PARAM_CHECKING_ENABLE == 1 */


/******************************************************************************
* Function Name: adc_configure_sensors
* Description  : This function set the sensor bits taking into account group
*                inclusion and addition/average mode.
* Arguments    : p_config -
*                   The configuration argument passed to ADC_CMD_ENABLE_CHANS.
* Return Value : none
*******************************************************************************/
static void adc_configure_sensors(adc_ch_cfg_t   *p_config)
{

    /* TEMPERATURE SENSOR */
    if ((p_config->chan_mask & ADC_MASK_TEMP)
    || (p_config->chan_mask_groupb & ADC_MASK_TEMP)
    || (p_config->chan_mask_groupc & ADC_MASK_TEMP))
    {

        /* Waiting time for sensors stabilization. 
           Stabilization time * margin = 200us * 1.1 = 220us  */
        R_BSP_SoftwareDelay(220, BSP_DELAY_MICROSECS);
    }

