renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx26t/r_s12ad_rx26t.c
    /* INTERNAL REFERENCE VOLTAGE SENSOR */
    if ((p_config->chan_mask & ADC_MASK_VOLT)
    || (p_config->chan_mask_groupb & ADC_MASK_VOLT)
    || (p_config->chan_mask_groupc & ADC_MASK_VOLT))
    {
        S12AD2.ADEXICR.BIT.OCSA = 0;
        S12AD2.ADEXICR.BIT.OCSB = 0;
        S12AD2.ADGCEXCR.BIT.OCSC = 0;

        S12AD2.ADVMONCR.BIT.VDE = 1;
        S12AD2.ADVMONO.BIT.VDO = 1;

        if (p_config->chan_mask & ADC_MASK_VOLT)
        {
            S12AD2.ADEXICR.BIT.OCSA = 1;            // select temperature output to GroupA
            S12AD2.ADEXICR.BIT.OCSB = 0;
            S12AD2.ADGCEXCR.BIT.OCSC = 0;
        }
        else if (p_config->chan_mask_groupb & ADC_MASK_VOLT)
        {
            S12AD2.ADEXICR.BIT.OCSA = 0;
            S12AD2.ADEXICR.BIT.OCSB = 1;            // select temperature output to GroupB
            S12AD2.ADGCEXCR.BIT.OCSC = 0;
        }
        else
        {
            S12AD2.ADEXICR.BIT.OCSA = 0;
            S12AD2.ADEXICR.BIT.OCSB = 0;
            S12AD2.ADGCEXCR.BIT.OCSC = 1;           // select temperature output to GroupC
        }

        S12AD2.ADEXICR.BIT.OCSAD = (p_config->add_mask & ADC_MASK_VOLT) ? 1 : 0;

        /* Waiting time for sensors stabilization.
           Stabilization time * margin = 400ns * 1.1 = 440ns
           The minimum wait time of R_BSP_SoftwareDelay is 1 us. */
        R_BSP_SoftwareDelay(1, BSP_DELAY_MICROSECS);
    }

    return;
} /* End of function adc_configure_sensors() */


/******************************************************************************
* Function Name: adc_enable_s12adi
* Description  : This function clears the S12ADI interrupt flag and enables
*                interrupts in the peripheral (for IR flag usage). If priority
*                is not 0, interrupts are enabled in the ICU.
*                NOTE: This has nothing to do with enabling triggers.
* Arguments    : unit -
*                   0 or 1
* Return Value : none
*******************************************************************************/
static void adc_enable_s12adi(uint8_t unit)
{
    if (0 == unit)
    {
        IR(S12AD,S12ADI) = 0;            // clear flag
        S12AD.ADCSR.BIT.ADIE = 1;           // enable in peripheral
        if (0 != IPR(S12AD,S12ADI))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD,S12ADI));       // enable in ICU
        }
    }
#if ADC_PRV_RAMSIZE_NOT_48K
    else if (1 == unit) /* Unit1 */
    {
        IR(S12AD1,S12ADI1) = 0;            // clear flag
        S12AD1.ADCSR.BIT.ADIE = 1;          // enable in peripheral
        if (0 != IPR(S12AD1,S12ADI1))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD1,S12ADI1));       // enable in ICU
        }
    }
#endif /* ADC_PRV_RAMSIZE_NOT_48K */
    else /* Unit2 */
    {
        IR(S12AD2,S12ADI2) = 0;            // clear flag
        S12AD2.ADCSR.BIT.ADIE = 1;          // enable in peripheral
        if (0 != IPR(S12AD2,S12ADI2))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD2,S12ADI2));       // enable in ICU
        }
    }
} /* End of function adc_enable_s12adi() */


/******************************************************************************
* Function Name: adc_enable_s12gbadi
* Description  : This function clears the S12GBADI interrupt flag and enables
*                interrupts in the peripheral (for IR flag usage). If priority
*                is not 0, interrupts are enabled in the ICU.
*                NOTE: This has nothing to do with enabling triggers.
* Arguments    : unit -
*                   0 or 1
* Return Value : none
*******************************************************************************/
static void adc_enable_s12gbadi(uint8_t unit)
{
    if (0 == unit)
    {
        IR(S12AD,S12GBADI) = 0;            // clear flag
        S12AD.ADCSR.BIT.GBADIE = 1;           // enable in peripheral
        if (0 != IPR(S12AD,S12GBADI))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD,S12GBADI));       // enable in ICU
        }
    }
#if ADC_PRV_RAMSIZE_NOT_48K
    else if (1 == unit) /* Unit1 */
    {
        IR(S12AD1,S12GBADI1) = 0;            // clear flag
        S12AD1.ADCSR.BIT.GBADIE = 1;          // enable in peripheral
        if (0 != IPR(S12AD1,S12GBADI1))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD1,S12GBADI1));       // enable in ICU
        }
    }
#endif /* ADC_PRV_RAMSIZE_NOT_48K /
    else /* Unit2 */
    {
        IR(S12AD2,S12GBADI2) = 0;            // clear flag
        S12AD2.ADCSR.BIT.GBADIE = 1;          // enable in peripheral
        if (0 != IPR(S12AD2,S12GBADI2))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD2,S12GBADI2));       // enable in ICU
        }
    }
} /* End of function adc_enable_s12gbadi() */


/******************************************************************************
* Function Name: adc_enable_s12gcadi
* Description  : This function clears the S12GCADI interrupt flag and enables
*                interrupts in the peripheral (for IR flag usage). If priority
*                is not 0, interrupts are enabled in the ICU.
*                NOTE: This has nothing to do with enabling triggers.
* Arguments    : unit -
*                   0 or 1
* Return Value : none
*******************************************************************************/
static void adc_enable_s12gcadi(uint8_t unit)
{
    if (0 == unit)
    {
        IR(S12AD,S12GCADI) = 0;           // clear flag
        S12AD.ADGCTRGR.BIT.GCADIE = 1;           // enable in peripheral
        if (0 != IPR(S12AD,S12GCADI))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD,S12GCADI));       // enable in ICU
        }
    }
#if ADC_PRV_RAMSIZE_NOT_48K
    else if (1 == unit) /* Unit1 */
    {
        IR(S12AD1,S12GCADI1) = 0;            // clear flag
        S12AD1.ADGCTRGR.BIT.GCADIE = 1;          // enable in peripheral
        if (0 != IPR(S12AD1,S12GCADI1))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD1,S12GCADI1));       // enable in ICU
        }
    }
#endif /* ADC_PRV_RAMSIZE_NOT_48K */
    else /* Unit2 */
    {
        IR(S12AD2,S12GCADI2) = 0;            // clear flag
        S12AD2.ADGCTRGR.BIT.GCADIE = 1;          // enable in peripheral
        if (0 != IPR(S12AD2,S12GCADI2))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD2,S12GCADI2));       // enable in ICU
        }
    }
} /* End of function adc_enable_s12gcadi() */


