renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx26t/r_s12ad_rx26t.c
/******************************************************************************
* Function Name: adc_close
* Description  : This is implementation of R_ADC_Close().
*                This function ends any scan in progress, disables interrupts,
*                and removes power to the A/D peripheral.
* Arguments    : none
* Return Value : ADC_SUCCESS - Successful
*                ADC_ERR_INVALID_ARG - unit contains an invalid value.
*******************************************************************************/
adc_err_t adc_close(uint8_t const  unit)
{

    /* Get S12AD register address */
    aregs_t     *p_regs = ADC_PRV_GET_REGS_PTR(unit);
    volatile    uint8_t i;
    uint32_t    adc_wait_microsecs;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    if (ADC_PRV_UNIT_CHECK)
    {
        return ADC_ERR_INVALID_ARG;
    }
#endif /* ADC_CFG_PARAM_CHECKING_ENABLE */

    /* Stop triggers & conversions, and disable peripheral interrupts */
    if (0 == unit)
    {
        R_BSP_InterruptRequestDisable(VECT(S12AD,S12ADI));         // disable interrupts in ICU
        R_BSP_InterruptRequestDisable(VECT(S12AD,S12GBADI));       // disable interrupts in ICU
        R_BSP_InterruptRequestDisable(VECT(S12AD,S12GCADI));       // disable interrupts in ICU

        IPR(S12AD,S12ADI) = 0;
        IPR(S12AD,S12GBADI) = 0;
        IPR(S12AD,S12GCADI) = 0;
    }
#if ADC_PRV_RAMSIZE_NOT_48K
    else if (1 == unit) /* Unit1 */
    {
        R_BSP_InterruptRequestDisable(VECT(S12AD1,S12ADI1));         // disable interrupts in ICU
        R_BSP_InterruptRequestDisable(VECT(S12AD1,S12GBADI1));       // disable interrupts in ICU
        R_BSP_InterruptRequestDisable(VECT(S12AD1,S12GCADI1));       // disable interrupts in ICU

        IPR(S12AD1,S12ADI1) = 0;
        IPR(S12AD1,S12GBADI1) = 0;
        IPR(S12AD1,S12GCADI1) = 0;
    }
#endif /* ADC_PRV_RAMSIZE_NOT_48K */
    else /* Unit2 */
    {
        R_BSP_InterruptRequestDisable(VECT(S12AD2,S12ADI2));         // disable interrupts in ICU
        R_BSP_InterruptRequestDisable(VECT(S12AD2,S12GBADI2));       // disable interrupts in ICU
        R_BSP_InterruptRequestDisable(VECT(S12AD2,S12GCADI2));       // disable interrupts in ICU

        IPR(S12AD2,S12ADI2) = 0;
        IPR(S12AD2,S12GBADI2) = 0;
        IPR(S12AD2,S12GCADI2) = 0;
    }

    /* This program does not disable IPR register of Group interrupt.
     * Because, other peripheral is possible to use same vector Group interrupt. */
    R_BSP_InterruptRequestDisable(VECT(ICU,GROUPBL1));                      // disable group

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
    ICU.GENBL1.LONG &= (~g_dcb[unit].cmpi_mask);  // disable group subvector
    ICU.GENBL1.LONG &= (~g_dcb[unit].cmpi_maskb);   // disable group subvector
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
    p_regs->ADCMPCR.BIT.CMPAIE = 0;             // disable interrupt in ADC
    if (0 == p_regs->ADCMPCR.BIT.CMPAIE)        // dummy read for waiting until set the value of CMPIE
    {
        R_BSP_NOP();
    }

    p_regs->ADCMPCR.BIT.CMPBIE = 0;             // disable interrupt in ADC
    if (0 == p_regs->ADCMPCR.BIT.CMPBIE)        // dummy read for waiting until set the value of CMPIE
    {
        R_BSP_NOP();
    }

    if (1 == p_regs->ADGSPCR.BIT.PGS)
    {
        p_regs->ADGSPCR.BIT.PGS = 0;
    }

    if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
    {
        p_regs->ADSTRGR.WORD = 0x3F3F;
        if (1 == p_regs->ADGCTRGR.BIT.GRCE)
        {
            p_regs->ADGCTRGR.BIT.TRSC = 0x3F;
            p_regs->ADGCTRGR.BIT.GCADIE = 0;
            p_regs->ADGCTRGR.BIT.GRCE = 0;
        }
        p_regs->ADCSR.BIT.GBADIE = 0;
    }
    else
    {
        p_regs->ADSTRGR.BIT.TRSA = 0x3F;
        p_regs->ADCSR.BIT.ADIE = 0;
    }

    p_regs->ADCSR.WORD = 0;
    if (0 != p_regs->ADCSR.WORD)
    {

        /* Dommy read and compare */
        R_BSP_NOP();
    }
    
    /* Wait for 2 ADCLK cycles (1 PCLKB + 1 ADCLK when ADCLK is faster than PCLKB */
    if (BSP_PCLKD_HZ > BSP_PCLKB_HZ)
    {
        /* 1PCLK + 1ADCLK Round up the decimal point */
        adc_wait_microsecs =  (uint32_t)((1000000 + (BSP_PCLKB_HZ - 1)) / BSP_PCLKB_HZ)
                            + (uint32_t)((1000000 + (BSP_PCLKD_HZ - 1)) / BSP_PCLKD_HZ);
    }
    else
    {
        /* 2ADCLK Round up the decimal point */
        adc_wait_microsecs =  (uint32_t)((2000000 + (BSP_PCLKD_HZ - 1)) / BSP_PCLKD_HZ);
    }
    R_BSP_SoftwareDelay (adc_wait_microsecs, BSP_DELAY_MICROSECS);

    /* Disabled the internal reference voltage monitoring function */
    if (2 == unit)
    {
        S12AD2.ADVMONO.BIT.VDO = 0;
        S12AD2.ADVMONCR.BIT.VDE = 0;
    }

    if (0 == unit)
    {
        IR(S12AD,S12ADI) = 0;          // clear interrupt flag
        IR(S12AD,S12GBADI) = 0;        // clear interrupt flag
        IR(S12AD,S12GCADI) = 0;        // clear interrupt flag
    }
#if ADC_PRV_RAMSIZE_NOT_48K
    else if (1 == unit) /* Unit1 */
    {
        IR(S12AD1,S12ADI1) = 0;          // clear interrupt flag
        IR(S12AD1,S12GBADI1) = 0;        // clear interrupt flag
        IR(S12AD1,S12GCADI1) = 0;        // clear interrupt flag
    }
#endif /* ADC_PRV_RAMSIZE_NOT_48K */
    else /* Unit2 */
    {
        IR(S12AD2,S12ADI2) = 0;          // clear interrupt flag
        IR(S12AD2,S12GBADI2) = 0;        // clear interrupt flag
        IR(S12AD2,S12GCADI2) = 0;        // clear interrupt flag
    }

    if(0 != ICU.GENBL1.LONG)
    {
        R_BSP_InterruptRequestEnable(VECT(ICU,GROUPBL1));                      // enable group
    }

    /* Power down peripheral */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
    if (0 == unit)
    {
        MSTP(S12AD) = 1;
    }
#if ADC_PRV_RAMSIZE_NOT_48K
    else if (1 == unit)
    {
        MSTP(S12AD1) = 1;
    }
#endif /* ADC_PRV_RAMSIZE_NOT_48K */
    else
    {
        MSTP(S12AD2) = 1;
    }
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

    /* Show driver as closed */
    g_dcb[unit].opened = false;

