renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx26t/r_s12ad_rx26t.c
    return ADC_SUCCESS;
} /* End of function adc_close() */

/******************************************************************************
* Function Name: adc_read_all
* Description  : This is implementation of R_ADC_ReadAll().
*                It reads conversion results from all potential sources,
*                enabled or not.
* Arguments    : p_data-
*                    Pointer to structure to load register values into.
* Return Value : ADC_SUCCESS-
*                    Successful
*******************************************************************************/
adc_err_t adc_read_all(adc_data_t * const  p_all_data)
{
#if ADC_PRV_RAMSIZE_IS_48K
    p_all_data->unit0.chan[ADC_REG_CH0]  = S12AD.ADDR0;
    p_all_data->unit0.chan[ADC_REG_CH1]  = S12AD.ADDR1;
    p_all_data->unit0.chan[ADC_REG_CH2]  = S12AD.ADDR2;
    p_all_data->unit0.chan[ADC_REG_CH3]  = S12AD.ADDR3;
    p_all_data->unit0.chan[ADC_REG_CH4]  = S12AD.ADDR4;
    p_all_data->unit0.chan[ADC_REG_CH5]  = S12AD.ADDR5;
    p_all_data->unit0.chan[ADC_REG_CH6]  = S12AD.ADDR6;
    p_all_data->unit0.dbltrig            = S12AD.ADDBLDR;
    p_all_data->unit0.dbltrigA           = S12AD.ADDBLDRA;
    p_all_data->unit0.dbltrigB           = S12AD.ADDBLDRB;
    p_all_data->unit0.self_diag          = S12AD.ADRD.WORD;
    
    p_all_data->unit2.chan[ADC_REG_CH0]  = S12AD2.ADDR0;
    p_all_data->unit2.chan[ADC_REG_CH1]  = S12AD2.ADDR1;
    p_all_data->unit2.chan[ADC_REG_CH2]  = S12AD2.ADDR2;
    p_all_data->unit2.chan[ADC_REG_CH3]  = S12AD2.ADDR3;
    p_all_data->unit2.chan[ADC_REG_CH4]  = S12AD2.ADDR4;
    p_all_data->unit2.chan[ADC_REG_CH5]  = S12AD2.ADDR5;
    p_all_data->unit2.chan[ADC_REG_CH6]  = S12AD2.ADDR6;
    p_all_data->unit2.chan[ADC_REG_CH7]  = S12AD2.ADDR7;
    p_all_data->unit2.chan[ADC_REG_CH8]  = S12AD2.ADDR8;
    p_all_data->unit2.chan[ADC_REG_CH9]  = S12AD2.ADDR9;
    p_all_data->unit2.chan[ADC_REG_CH10] = S12AD2.ADDR10;
    p_all_data->unit2.chan[ADC_REG_CH11] = S12AD2.ADDR11;
    p_all_data->unit2.chan[ADC_REG_CH16] = S12AD2.ADDR16;
    p_all_data->unit2.chan[ADC_REG_CH17] = S12AD2.ADDR17;
    p_all_data->unit2.temp               = S12AD2.ADTSDR;
    p_all_data->unit2.volt               = S12AD2.ADOCDR;
    p_all_data->unit2.dbltrig            = S12AD2.ADDBLDR;
    p_all_data->unit2.dbltrigA           = S12AD2.ADDBLDRA;
    p_all_data->unit2.dbltrigB           = S12AD2.ADDBLDRB;
    p_all_data->unit2.self_diag          = S12AD2.ADRD.WORD;
#else
    p_all_data->unit0.chan[ADC_REG_CH0]  = S12AD.ADDR0;
    p_all_data->unit0.chan[ADC_REG_CH1]  = S12AD.ADDR1;
    p_all_data->unit0.chan[ADC_REG_CH2]  = S12AD.ADDR2;
    p_all_data->unit0.chan[ADC_REG_CH3]  = S12AD.ADDR3;
    p_all_data->unit0.dbltrig            = S12AD.ADDBLDR;
    p_all_data->unit0.dbltrigA           = S12AD.ADDBLDRA;
    p_all_data->unit0.dbltrigB           = S12AD.ADDBLDRB;
    p_all_data->unit0.self_diag          = S12AD.ADRD.WORD;

    p_all_data->unit1.chan[ADC_REG_CH0]  = S12AD1.ADDR0;
    p_all_data->unit1.chan[ADC_REG_CH1]  = S12AD1.ADDR1;
    p_all_data->unit1.chan[ADC_REG_CH2]  = S12AD1.ADDR2;
    p_all_data->unit1.chan[ADC_REG_CH3]  = S12AD1.ADDR3;
    p_all_data->unit1.dbltrig            = S12AD1.ADDBLDR;
    p_all_data->unit1.dbltrigA           = S12AD1.ADDBLDRA;
    p_all_data->unit1.dbltrigB           = S12AD1.ADDBLDRB;
    p_all_data->unit1.self_diag          = S12AD1.ADRD.WORD;

    p_all_data->unit2.chan[ADC_REG_CH0]  = S12AD2.ADDR0;
    p_all_data->unit2.chan[ADC_REG_CH1]  = S12AD2.ADDR1;
    p_all_data->unit2.chan[ADC_REG_CH2]  = S12AD2.ADDR2;
    p_all_data->unit2.chan[ADC_REG_CH3]  = S12AD2.ADDR3;
    p_all_data->unit2.chan[ADC_REG_CH4]  = S12AD2.ADDR4;
    p_all_data->unit2.chan[ADC_REG_CH5]  = S12AD2.ADDR5;
    p_all_data->unit2.chan[ADC_REG_CH6]  = S12AD2.ADDR6;
    p_all_data->unit2.chan[ADC_REG_CH7]  = S12AD2.ADDR7;
    p_all_data->unit2.chan[ADC_REG_CH8]  = S12AD2.ADDR8;
    p_all_data->unit2.chan[ADC_REG_CH9]  = S12AD2.ADDR9;
    p_all_data->unit2.chan[ADC_REG_CH10] = S12AD2.ADDR10;
    p_all_data->unit2.chan[ADC_REG_CH11] = S12AD2.ADDR11;
    p_all_data->unit2.chan[ADC_REG_CH16] = S12AD2.ADDR16;
    p_all_data->unit2.chan[ADC_REG_CH17] = S12AD2.ADDR17;
    p_all_data->unit2.temp               = S12AD2.ADTSDR;
    p_all_data->unit2.volt               = S12AD2.ADOCDR;
    p_all_data->unit2.dbltrig            = S12AD2.ADDBLDR;
    p_all_data->unit2.dbltrigA           = S12AD2.ADDBLDRA;
    p_all_data->unit2.dbltrigB           = S12AD2.ADDBLDRB;
    p_all_data->unit2.self_diag          = S12AD2.ADRD.WORD;
#endif /* ADC_PRV_RAMSIZE_IS_48K */

    return ADC_SUCCESS;
} /* End of function adc_read_all() */


/*****************************************************************************
* Function Name: adc_s12cmpia0_isr
* Description  : Unit0 interrupt handler (bsp GRPBL1 callback) for comparator.
* Arguments    : none
* Return Value : none
******************************************************************************/
static void adc_s12cmpia0_isr(void *cb_args)
{
    adc_cb_args_t   args;

    if ((NULL != g_dcb[0].p_callback) && (FIT_NO_FUNC != g_dcb[0].p_callback))
    {

        /* NOTE: S12CMPI interrupts are level-based, not edge, so there will be
         * continuous triggers while condition is met. When the condition is no
         * longer met, both the ICU.GRPBL1 flag and subvector flag are
         * automatically cleared.
         */
        args.event = ADC_EVT_CONDITION_MET;
        args.unit = 0;
        args.compare_flags = adc_get_and_clr_cmpi_flags(0);
        g_dcb[0].p_callback(&args);
    }
    else
    {
        adc_get_and_clr_cmpi_flags(0);
    }
} /* End of function adc_s12cmpia0_isr() */


/*****************************************************************************
* Function Name: adc_s12cmpib0_isr
* Description  : Unit0 interrupt handler (bsp GRPBL1 callback) for comparator.
* Arguments    : none
* Return Value : none
******************************************************************************/
static void adc_s12cmpib0_isr(void *cb_args)
{
    adc_cb_args_t   args;

